In [19]:
import pandas as pd
import numpy as np
df = pd.read_csv("income.csv")

In [20]:
df

        Name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [21]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [27]:
df.income.sort_values()

2        4000
0        5000
1        6000
5        7000
3        7500
4        8000
6    10000000
Name: income, dtype: int64

In [38]:
df.income.quantile(0.25, interpolation = "linear")

5500.0

In [39]:
df.income.quantile(1, interpolation = "linear")

10000000.0

In [40]:
percentile_99 = df.income.quantile(0.99)

In [41]:
percentile_99

9400479.999999994

In [42]:
df[df.income>percentile_99]

        Name    income
6  Elon Musk  10000000

In [45]:
df_no_outlier = df[df.income<percentile_99]

In [46]:
df_no_outlier

    Name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [47]:
df['income'][3] = np.NaN

C:\Users\DELL\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\DELL\AppData\Local\Programs\Python\Python37\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [48]:
df

        Name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [49]:
df.income.mean()

1671666.6666666667

In [50]:
df_new = df.fillna(df.income.mean())

In [51]:
df_new

        Name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [52]:
df_new = df.fillna(df.income.median())

In [53]:
df_new

        Name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0